app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "price", "publish_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "A Recent Book"], ["author", "Me"], ["price", "49.0"], ["publish_date", "2025-08-31"], ["created_at", "2025-09-09 04:03:38.102985"], ["updated_at", "2025-09-09 04:03:38.102985"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save